Revit 2027 API
FilteredElementCollector.WhereElementIsCurveDriven Method
 Applies an ElementIsCurveDrivenFilter to the collector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredElementCollector WhereElementIsCurveDriven()
Public Function WhereElementIsCurveDriven As FilteredElementCollector
public:
FilteredElementCollector^ WhereElementIsCurveDriven()
member WhereElementIsCurveDriven : unit -> FilteredElementCollector
Return Value
FilteredElementCollector
 A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.
Remarks
 Only elements that are curve driven will pass the collector. If you have an active iterator to this collector it will be stopped by this call.
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace